%eig demo
%演示方阵的特征值与特征向量的计算

%e = eig(A) 返回一个列向量，其中包含方阵 A 的特征值。
A = gallery('lehmer',4);
e = eig(A);
disp(e);
%[V,D] = eig(A) 返回特征值的对角矩阵 D 和矩阵 V，其列是对应的右特征向量，使得 A*V = V*D。
%默认情况下，eig 并不总是返回已排序的特征值和特征向量。可以使用 sort 函数将特征值按升序排序，并重新排序相应的特征向量。

A = magic(5);
[V,D] = eig(A);
disp(D);%A 的特征值位于 D 的对角线上。但是，特征值并未排序。

%使用 diag(D) 从 D 的对角线上提取特征值，然后按升序对得到的向量进行排序。sort 的第二个输出返回索引的置换向量。
[d,ind] = sort(diag(D));

%使用 ind 对 D 的对角线元素进行重新排序。由于 D 中的特征值对应于 V 的各列中的特征向量，因此您还必须使用相同的索引对 V 的列进行重新排序。
Ds = D(ind,ind);
Vs = V(:,ind);
